{
  "id": "root",
  "label": "Vitamins in Human Body",
  "summary": "Essential micronutrients required for normal metabolic function, growth, and overall health, typically obtained through diet.",
  "description": "Essential micronutrients required for normal metabolic function, growth, and overall health, typically obtained through diet. They are vital for diverse bodily processes, including energy production, immune defense, and cellular repair, playing a crucial role in preventing various diseases and maintaining overall well-being.",
  "metadata": {
    "category": "Nutrition",
    "importance": "High"
  },
  "children": [
    {
      "id": "classification",
      "label": "Vitamin Classification",
      "summary": "Vitamins are primarily classified based on their solubility",
      "description": "Vitamins are primarily classified based on their solubility in fats or water, which dictates their absorption, storage, and excretion mechanisms in the body. This fundamental distinction influences dietary intake recommendations, potential for toxicity, and how they are utilized by different physiological systems.",
      "type": "category",
      "metadata": {
        "classificationType": "Solubility-based"
      },
      "children": [
        {
          "id": "fat-soluble",
          "label": "Fat-Soluble Vitamins",
          "summary": "Vitamins A, D, E, K - stored in body fat",
          "description": "Fat-soluble vitamins (A, D, E, K) are absorbed along with fats in the diet and can be stored in the body's fatty tissue and liver for later use.",
          "type": "subcategory",
          "metadata": {
            "examples": ["Vitamin A", "Vitamin D", "Vitamin E", "Vitamin K"],
            "storage": "Liver and fatty tissues"
          },
          "children": [
            {
              "id": "vitamin-a",
              "label": "Vitamin A",
              "summary": "Essential for vision, immune function, and reproduction",
              "description": "Vitamin A is crucial for maintaining healthy vision, supporting the immune system, and ensuring proper organ function and reproduction.",
              "type": "detail",
              "metadata": {
                "dietarySources": ["Carrots", "Sweet potatoes", "Spinach", "Liver"],
                "deficiency": "Night blindness",
                "toxicity": "Possible in high doses"
              }
            }
          ]
        },
        {
          "id": "water-soluble",
          "label": "Water-Soluble Vitamins",
          "summary": "Vitamin C and B-complex - not stored, need regular intake",
          "description": "Water-soluble vitamins (Vitamin C and all B vitamins) dissolve in water and are not stored in the body; excess amounts are excreted through urine.",
          "type": "subcategory",
          "metadata": {
            "examples": ["Vitamin C", "B1", "B2", "B3", "B6", "B12", "Folate"],
            "storage": "Not stored, regular intake needed"
          }
        }
      ]
    },
    {
      "id": "sources",
      "label": "Dietary Sources",
      "summary": "Natural food sources of vitamins",
      "description": "Vitamins are obtained through a balanced diet including fruits, vegetables, grains, dairy, and protein sources.",
      "type": "category",
      "metadata": {
        "importance": "Diet-dependent"
      }
    },
    {
      "id": "impact",
      "label": "Health Impact & Balance",
      "summary": "Effects of deficiency and excess",
      "description": "Both deficiency and excess of vitamins can lead to health issues, highlighting the importance of balanced intake.",
      "type": "category",
      "metadata": {
        "balance": "Critical"
      }
    },
    {
      "id": "roles",
      "label": "Key Bodily Roles",
      "summary": "Essential functions in the body",
      "description": "Vitamins play crucial roles in metabolism, immunity, growth, and cellular function.",
      "type": "category",
      "metadata": {
        "functions": ["Metabolism", "Immunity", "Growth", "Repair"]
      }
    }
  ]
}